const About = () => {
  return (
    <div
      dir="rtl"
      className="about bg-gray-400 p-8 min-h-screen flex items-center justify-center"
    >
      <div className="bg-white rounded-lg shadow-lg p-8 max-w-4xl w-full">
        <h1 className="text-4xl font-extrabold text-center mb-6 text-blue-600">
          درباره پروژه
        </h1>
        <p className="text-lg text-gray-800 leading-relaxed text-justify w-full md:w-11/12 mx-auto">
          این پروژه یک سیستم مدیریت اطلاعات دانشجویی است که با استفاده از React
          ساخته شده است. هدف اصلی این پروژه این است که به کاربران این امکان را
          بدهد تا اطلاعات دانشجویان خود را به راحتی وارد کرده، جستجو کنند، و یا
          رکوردهای موجود را ویرایش یا حذف کنند. در این سیستم، کاربران می‌توانند
          اطلاعات جدید دانشجویان را وارد کنند، به طوری که شماره دانشجویی هر
          دانشجو باید منحصر به فرد باشد. این ویژگی از ورود رکوردهای تکراری
          جلوگیری می‌کند. همچنین، سیستم به کاربران این امکان را می‌دهد که
          رکوردها را بر اساس نام یا شماره دانشجویی جستجو کنند. علاوه بر این،
          قابلیت مرتب‌سازی رکوردها نیز بر اساس معیارهای مختلف مانند شماره
          دانشجویی، نام یا معدل وجود دارد. در صورت نیاز، کاربران می‌توانند
          اطلاعات دانشجویان را ویرایش کرده و یا رکوردهایی که دیگر نیازی به آن‌ها
          ندارند را حذف کنند. همچنین، سیستم می‌تواند میانگین معدل دانشجویان را
          محاسبه و نمایش دهد. این پروژه با هدف سهولت در مدیریت و دسترسی به
          اطلاعات دانشجویان در محیط‌های آموزشی طراحی شده و رابط کاربری ساده‌ای
          را برای تعامل با داده‌ها فراهم می‌آورد.
        </p>
      </div>
    </div>
  );
};

export default About;
